Revit 2027 API
StairsLanding.GetConnections Method
 Returns information about the connections in which the stairs landing participates.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<StairsComponentConnection> GetConnections()
Public Function GetConnections As IList(Of StairsComponentConnection)
public:
IList<StairsComponentConnection^>^ GetConnections()
member GetConnections : unit -> IList<StairsComponentConnection>
Return Value
IList<StairsComponentConnection>
 The connections in which the stairs landing participates.
See Also
Reference
StairsLanding Class
Autodesk.Revit.DB.Architecture Namespace